qwe111845/stm32/stm32f429i_drivers/Src/003_led_button_external.c
#include <stdint.h>
#include "stm32f429i.h"

#define HIGH        ENABLE
#define LOW         DISABLE

#define BTN_PRESSED LOW

void delay(void) {
	for (uint32_t i = 0; i < 300000; i++);
}

int main(void)
{


	GPIO_Handle_t GPIOLed;

	GPIOLed.pGPIO = GPIOA;
	GPIOLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_8;
	GPIOLed.GPIO_PinConfig.GPIO_PinMode   = GPIO_MODE_OUTPUT;
	GPIOLed.GPIO_PinConfig.GPIO_PinSpeed  = GPIO_SPEED_FAST;
	GPIOLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GPIOLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PeriClocckControl(GPIOA, ENABLE);

	GPIO_Init(&GPIOLed);

	GPIO_Handle_t GPIOButton;

	GPIOButton.pGPIO = GPIOB;
	GPIOButton.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GPIOButton.GPIO_PinConfig.GPIO_PinMode   = GPIO_MODE_INPUT;
	GPIOButton.GPIO_PinConfig.GPIO_PinSpeed  = GPIO_SPEED_FAST;
	GPIOButton.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PU;

	GPIO_PeriClocckControl(GPIOB, ENABLE);

	GPIO_Init(&GPIOButton);


	while (1) {
		if (GPIO_ReadFromInputPin(GPIOB, GPIO_PIN_NO_12) == BTN_PRESSED) {
			delay();
			GPIO_ToggleOutputPin(GPIOA, GPIO_PIN_NO_8);
		}
	}


	return 0;
}
